readme updated with live link and developed app info
